examples/vertical_duct_fixed_boundary/assets/openfoam-case-template/simpleFoam/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousFilter{
    type explicitPorositySource;

    explicitPorositySourceCoeffs{
        selectionMode cellZone;
        cellZone mesh;
        type DarcyForchheimer;

        d   (14000 14000 14000);
        f   (17.11 17.11 17.11);

        coordinateSystem{
            origin (0 0 0);
            rotation none;
        }
    }
}